`Prerequisites`

To complete this exercise, you must have access to the `little_lemon` database. As an authorized user, you need to establish a connection between Python and the database via the connector API and create a cursor object

Once the connection is established, and you have a cursor object, you can select the database little_lemon and print the names of the tables

You should have the four created tables from previous labs in your database envionrment


#### Learning objectives:
* Create records in a MySQL database using Python
* Read records in a MySQL database using Python


`Scenario:`

Little Lemon restaurant has created a database and designed tables to keep records of key data. The list of tables that theyâ€™ve created are as follows:
* A table called Menu that stores menu data, 
* A table called MenuItems that stores data on menu items, 
* A table called Orders that stores data on customer orders, 
* And a table called Bookings that stores data on customer bookings. 

They now need to populate these tables with relevant data. They also need to read the data once the records have been inserted into the database.

Help Little Lemon create and read data in their MySQL database using Python.                 


#### Connection & Cursor
Prior to the Tasks, let's create the connection and cursor objects

In [18]:
import mysql.connector as connector

try:
    connection=connector.connect(user="root", password="")
    print('Connection established!')
except connector.Error as e:
    print(f"""
    Error code : {e.errno}|
    Error message : {e.msg}
    """)

Connection established!

In [19]:
## Create default cursor
cursor = connection.cursor()
cursor.execute('SHOW DATABASES')
print(cursor.fetchall())

[('automobile',), ('information_schema',), ('jewelrystore_db',), ('little_lemon',), ('Lucky_Shrub',), ('luckyshrub_db',), ('Mangata_Gallo',), ('mysql',), ('performance_schema',), ('restaurant',), ('soccer',), ('sys',)]

In [20]:
# use little_lemon
cursor.execute('USE little_lemon;')
# Validate connection database
connection.database

'little_lemon'

In [21]:
## Let's review the tables prior to insertion
cursor.execute('SHOW TABLES')
tables = [x[0] for x in cursor.fetchall()]
tables

['Bookings', 'MenuItems', 'Menus', 'Orders']

In [22]:
# Can we loop through to see if any of the tables have records?
for table in tables:
    cursor.execute("""
    SELECT COUNT(*) FROM {}
    """.format(table))
    print(f'Our table: {table}, has a total of {len(cursor.fetchall())} rows')

Our table: Bookings, has a total of 1 rows
Our table: MenuItems, has a total of 1 rows
Our table: Menus, has a total of 1 rows
Our table: Orders, has a total of 1 rows

In [24]:
table_rows_pre_insertion = {}
for table in tables:
    cursor.execute("""
    SELECT * FROM {}
    """.format(table))
    table_rows_pre_insertion[table] = cursor.fetchall()
    #print(cursor.fetchall()) # InterfaceError: No result set to fetch from.

print(table_rows_pre_insertion)

{'Bookings': [], 'MenuItems': [], 'Menus': [], 'Orders': []}

```sql
mysql> SELECT COUNT(*) FROM Bookings;
+----------+
| COUNT(*) |
+----------+
|        0 |
+----------+
1 row in set (0.00 sec)
```

* Ahhh was being a bit foolish here as there is one row as it's an aggregate count for each. Nothing in any of the tables so we can now insert

### **Task 1:**
* Insert data in all four tables in the little_lemon database using Python. 
* Use the following INSERT queries to populate the tables with relevant data.

In [25]:
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1,12,'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

# Execute commit
cursor.execute(insert_bookings)

In [26]:
cursor.execute('SELECT * FROM Bookings;')
cursor.fetchall()

[(1, 12, 'Anna', 'Iversen', datetime.timedelta(seconds=68400), 1),
 (2, 12, 'Joakim', 'Iversen', datetime.timedelta(seconds=68400), 1),
 (3, 19, 'Vanessa', 'McCarthy', datetime.timedelta(seconds=54000), 3),
 (4, 15, 'Marcos', 'Romero', datetime.timedelta(seconds=63000), 4),
 (5, 5, 'Hiroki', 'Yamane', datetime.timedelta(seconds=66600), 2),
 (6, 8, 'Diana', 'Pinto', datetime.timedelta(seconds=72000), 5)]

In [28]:
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1,'Olives','Starters',5),
(2,'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10,'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

cursor.execute(insert_menuitems)

insert_menu="""
INSERT INTO Menus (MenuID, ItemID, Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

cursor.execute(insert_menu)

insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

cursor.execute(insert_orders)

## commit all changes to connection
connection.commit()

```sql
mysql> SELECT * FROM Bookings;
+-----------+---------+----------------+---------------+-------------+------------+
| BookingID | TableNo | GuestFirstName | GuestLastName | BookingSlot | EmployeeID |
+-----------+---------+----------------+---------------+-------------+------------+
|         1 |      12 | Anna           | Iversen       | 19:00:00    |          1 |
|         2 |      12 | Joakim         | Iversen       | 19:00:00    |          1 |
|         3 |      19 | Vanessa        | McCarthy      | 15:00:00    |          3 |
|         4 |      15 | Marcos         | Romero        | 17:30:00    |          4 |
|         5 |       5 | Hiroki         | Yamane        | 18:30:00    |          2 |
|         6 |       8 | Diana          | Pinto         | 20:00:00    |          5 |
+-----------+---------+----------------+---------------+-------------+------------+
6 rows in set (0.00 sec)
```

```sql
mysql> SELECT * FROM MenuItems;
+--------+-------------------+--------------+-------+
| ItemID | Name              | Type         | Price |
+--------+-------------------+--------------+-------+
|      1 | Olives            | Starters     |     5 |
|      2 | Flatbread         | Starters     |     5 |
|      3 | Minestrone        | Starters     |     8 |
|      4 | Tomato bread      | Starters     |     8 |
|      5 | Falafel           | Starters     |     7 |
|      6 | Hummus            | Starters     |     5 |
|      7 | Greek salad       | Main Courses |    15 |
|      8 | Bean soup         | Main Courses |    12 |
|      9 | Pizza             | Main Courses |    15 |
|     10 | Greek yoghurt     | Desserts     |     7 |
|     11 | Ice cream         | Desserts     |     6 |
|     12 | Cheesecake        | Desserts     |     4 |
|     13 | Athens White wine | Drinks       |    25 |
|     14 | Corfu Red Wine    | Drinks       |    30 |
|     15 | Turkish Coffee    | Drinks       |    10 |
|     16 | Turkish Coffee    | Drinks       |    10 |
|     17 | Kabasa            | Main Courses |    17 |
+--------+-------------------+--------------+-------+
17 rows in set (0.00 sec)
```

```sql
mysql> SELECT * FROM Menus;
+--------+--------+---------+
| MenuID | ItemID | Cuisine |
+--------+--------+---------+
|      1 |      1 | Greek   |
|      1 |      7 | Greek   |
|      1 |     10 | Greek   |
|      1 |     13 | Greek   |
|      2 |      3 | Italian |
|      2 |      9 | Italian |
|      2 |     12 | Italian |
|      2 |     15 | Italian |
|      3 |      5 | Turkish |
|      3 |     11 | Turkish |
|      3 |     16 | Turkish |
|      3 |     17 | Turkish |
+--------+--------+---------+
12 rows in set (0.01 sec)
```

```sql
mysql> SELECT * FROM Orders;
+---------+---------+--------+-----------+------------+----------+
| OrderID | TableNo | MenuID | BookingID | BillAmount | Quantity |
+---------+---------+--------+-----------+------------+----------+
|       1 |      12 |      1 |         1 |         86 |        2 |
|       2 |      19 |      2 |         2 |         37 |        1 |
|       3 |      15 |      2 |         3 |         37 |        1 |
|       4 |       5 |      3 |         4 |         40 |        1 |
|       5 |       8 |      1 |         5 |         43 |        1 |
+---------+---------+--------+-----------+------------+----------+
5 rows in set (0.07 sec)
```

### **Task 2:**

In the first task, you created tables to hold the restaurantâ€™s data. Now Little Lemon requires you to retrieve the following data for each guest:
* Guest first and last names.
* The table number assigned to each guest.

In [29]:
all_bookings = """SELECT GuestFirstName, GuestLastName, TableNo FROM Bookings"""
cursor.execute(all_bookings)
cursor.fetchall()

[('Anna', 'Iversen', 12),
 ('Joakim', 'Iversen', 12),
 ('Vanessa', 'McCarthy', 19),
 ('Marcos', 'Romero', 15),
 ('Hiroki', 'Yamane', 5),
 ('Diana', 'Pinto', 8)]

### **Task 3**
Little Lemonâ€™s queries are returning large volumes of data. They need to find a way to return the data in smaller, more manageable chunks. Letâ€™s see if you can help them to return just the first three items from the menu. In other words, return the first three items from the cursor.

Once the .execute() method is called on the select statement, you will have access to the rows effected. All of this data can returned at once using the  .fetchall() method or returned in smaller chunks using some of cursorâ€™s other methods.  Write the code that instantiates a cursor and executes the select_stmt but only returns 3 rows.

In [30]:
# Query to retrieve all bookings is: 
all_menus = """SELECT * FROM Menus;"""

# Execute query 
cursor.execute(all_menus)

# Fetch fist 3 records in results
results = cursor.fetchmany(size=3)

# Retrieve column names
cols = cursor.column_names

# Print column names and records from results using for loop
print("""Data in the "Menu" table:""")
print(cols)
for result in results:
    print(result)

Data in the "Menu" table:
('MenuID', 'ItemID', 'Cuisine')
(1, 1, 'Greek')
(1, 7, 'Greek')
(1, 10, 'Greek')

In [31]:
# Remaining records after fetching the first three
results= cursor.fetchall()
for result in results:
    print(result)

(1, 13, 'Greek')
(2, 3, 'Italian')
(2, 9, 'Italian')
(2, 12, 'Italian')
(2, 15, 'Italian')
(3, 5, 'Turkish')
(3, 11, 'Turkish')
(3, 16, 'Turkish')
(3, 17, 'Turkish')

* If we look at the menus table following the insertion, we can see that the remaining records in the cursor are retrieved with the `fetchall` without the first three which the cursor had iterated through in the two cells above

In [32]:
cursor.close()
connection.close()